---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.LoadTypeBase
source: html/e5ccbabc-000f-3f40-7da5-ee591b61545d.htm
---
# LoadTypeBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.